Autodesk.Revit.UI.DockablePaneState.SetFloatingRectangle(Autodesk.Revit.UI.Rectangle)
When %dockPosition% is Floating, sets the rectangle used to determine the size and position of the pane when %dockPosition% is Floating.  Coordinates are relative to the upper-left-hand corner of the main Revit window.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Rectangle is not normalized.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.UI.DockablePaneState.TabBehind
Ignored unless %dockPosition% is Tabbed.  The new pane will appear in a tab behind the specified existing pane ID.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: no dockable pane has been registered with identifier tabBehind.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.UI.DockablePaneState.#ctor(Autodesk.Revit.UI.DockablePaneState)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014